Revit 2027 API
RebarSpliceTypeUtils.GetShiftOption Method
 Identifies the way bars are shifted in the splice relation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static RebarSpliceShiftOption GetShiftOption(
	Document document,
	ElementId rebarSpliceTypeId
)
Public Shared Function GetShiftOption (
	document As Document,
	rebarSpliceTypeId As ElementId
) As RebarSpliceShiftOption
public:
static RebarSpliceShiftOption GetShiftOption(
	Document^ document,
	ElementId^ rebarSpliceTypeId
)
static member GetShiftOption :
        document : Document *
        rebarSpliceTypeId : ElementId -> RebarSpliceShiftOption
Parameters
document Document
 The document.
rebarSpliceTypeId ElementId
 The Rebar Splice Type id.
Return Value
RebarSpliceShiftOption
 Returns the way bars are shifted in the splice relation.
Exceptions
Exception | Condition
ArgumentException |  The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarSpliceTypeUtils Class
Autodesk.Revit.DB.Structure Namespace